
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыводитьТипыЭлементов			= Параметры.ВыводитьТипыЭлементов;
	ВыводитьСсылочныеРеквизиты		= Параметры.ВыводитьСсылочныеРеквизиты;
	ВысотаСтраницы					= Параметры.ВысотаСтраницы;
	ВысотаСтрок						= Параметры.ВысотаСтрок;
	НачальнаяКоординатаX			= Параметры.НачальнаяКоординатаX;
	НачальнаяКоординатаY			= Параметры.НачальнаяКоординатаY;
	РазделительИмениИТипа			= Параметры.РазделительИмениИТипа;
	РасстояниеМеждуТаблицами		= Параметры.РасстояниеМеждуТаблицами;
	СкрытьТаблицыПодШапку			= Параметры.СкрытьТаблицыПодШапку;
	УбратьЛинииСвязейНаЗаднийПлан	= Параметры.УбратьЛинииСвязейНаЗаднийПлан;
	ШиринаПоляОписание				= Параметры.ШиринаПоляОписание;
	ШиринаПоляСвойство				= Параметры.ШиринаПоляСвойство;
	ШиринаСтраницы					= Параметры.ШиринаСтраницы;
	ШиринаТаблицы					= Параметры.ШиринаТаблицы;
	
	Элементы.РазделительИмениИТипа.Доступность = ВыводитьТипыЭлементов;
	
КонецПроцедуры

&НаКлиенте
Процедура ШиринаТаблицыПриИзменении(Элемент)
	
	ШиринаПоляСвойство = ШиринаТаблицы * 0.25;
	ШиринаПоляОписание = ШиринаТаблицы * 0.75;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьТипыЭлементовПриИзменении(Элемент)
	
	Элементы.РазделительИмениИТипа.Доступность = ВыводитьТипыЭлементов;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьНастройки(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	МассивОшибок = Новый Массив;
	
	Если ВысотаСтрок > ВысотаСтраницы Тогда
		МассивОшибок.Добавить("Высота строк не может быть больше высоты страницы");
	КонецЕсли;
	
	Если НачальнаяКоординатаY > ВысотаСтраницы Тогда
		МассивОшибок.Добавить("Начальная координата ординаты (Y) не может быть больше высоты страницы");
	КонецЕсли;
	
	Если ШиринаТаблицы > ШиринаСтраницы Тогда
		МассивОшибок.Добавить("Ширина таблицы не может быть больше ширины страницы");
	КонецЕсли;
	
	Если НачальнаяКоординатаX > ШиринаСтраницы Тогда
		МассивОшибок.Добавить("Начальная координата абсциссы (X) не может быть больше ширины страницы");
	КонецЕсли;
	
	Если (ШиринаПоляСвойство + ШиринаПоляОписание) > ШиринаТаблицы Тогда
		МассивОшибок.Добавить("Сумма ширины поля свойство и ширины поля описание не может быть больше ширины таблицы");
	КонецЕсли;
	
	Если МассивОшибок.Количество() Тогда
		Для Каждого ЭлементОшибка Из МассивОшибок Цикл
			Сообщить(ЭлементОшибка);
		КонецЦикла;
		
		Возврат;
	КонецЕсли;
	
	ОсновнаяФорма = ЭтотОбъект.ВладелецФормы;
	
	ОсновнаяФорма.ВыводитьТипыЭлементов			= ВыводитьТипыЭлементов;
	ОсновнаяФорма.ВыводитьСсылочныеРеквизиты	= ВыводитьСсылочныеРеквизиты;
	ОсновнаяФорма.ВысотаСтраницы				= ВысотаСтраницы;
	ОсновнаяФорма.ВысотаСтрок					= ВысотаСтрок;
	ОсновнаяФорма.НачальнаяКоординатаX			= НачальнаяКоординатаX;
	ОсновнаяФорма.НачальнаяКоординатаY			= НачальнаяКоординатаY;
	ОсновнаяФорма.РазделительИмениИТипа			= РазделительИмениИТипа;
	ОсновнаяФорма.РасстояниеМеждуТаблицами		= РасстояниеМеждуТаблицами;
	ОсновнаяФорма.СкрытьТаблицыПодШапку			= СкрытьТаблицыПодШапку;
	ОсновнаяФорма.УбратьЛинииСвязейНаЗаднийПлан	= УбратьЛинииСвязейНаЗаднийПлан;
	ОсновнаяФорма.ШиринаПоляОписание			= ШиринаПоляОписание;
	ОсновнаяФорма.ШиринаПоляСвойство			= ШиринаПоляСвойство;
	ОсновнаяФорма.ШиринаСтраницы				= ШиринаСтраницы;
	ОсновнаяФорма.ШиринаТаблицы					= ШиринаТаблицы;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы