
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДеревоФормы = РеквизитФормыВЗначение("ДеревоМетаданных");
	
	СтрокаКласса = ДеревоФормы.Строки.Добавить();
	СтрокаКласса.Имя = "Справочники";
	СтрокаКласса.Картинка	= ЗаполнитьКартинкуВСтрокуДерева(СтрокаКласса.Имя);
	
	Для Каждого ОбъектМетаданных Из Метаданные.Справочники Цикл
		
		СтрокаОбъекта = СтрокаКласса.Строки.Добавить();
		СтрокаОбъекта.Картинка	= ЗаполнитьКартинкуВСтрокуДерева(СтрокаКласса.Имя);
		СтрокаОбъекта.Имя		= ОбъектМетаданных.Имя;
		СтрокаОбъекта.Синоним	= ОбъектМетаданных.Синоним;
		СтрокаОбъекта.ПолноеИмя	= ОбъектМетаданных.ПолноеИмя();
		
	КонецЦикла;
	
	СтрокаКласса = ДеревоФормы.Строки.Добавить();
	СтрокаКласса.Имя = "Документы";
	СтрокаКласса.Картинка	= ЗаполнитьКартинкуВСтрокуДерева(СтрокаКласса.Имя);
	
	Для Каждого ОбъектМетаданных Из Метаданные.Документы Цикл
		
		СтрокаОбъекта = СтрокаКласса.Строки.Добавить();
		СтрокаОбъекта.Картинка	= ЗаполнитьКартинкуВСтрокуДерева(СтрокаКласса.Имя);
		СтрокаОбъекта.Имя		= ОбъектМетаданных.Имя;
		СтрокаОбъекта.Синоним	= ОбъектМетаданных.Синоним;
		СтрокаОбъекта.ПолноеИмя	= ОбъектМетаданных.ПолноеИмя();
		
	КонецЦикла;
	
	СтрокаКласса = ДеревоФормы.Строки.Добавить();
	СтрокаКласса.Имя = "Регистры сведений";
	СтрокаКласса.Картинка	= ЗаполнитьКартинкуВСтрокуДерева(СтрокаКласса.Имя);
	
	Для Каждого ОбъектМетаданных Из Метаданные.РегистрыСведений Цикл
		
		СтрокаОбъекта = СтрокаКласса.Строки.Добавить();
		СтрокаОбъекта.Картинка	= ЗаполнитьКартинкуВСтрокуДерева(СтрокаКласса.Имя);
		СтрокаОбъекта.Имя		= ОбъектМетаданных.Имя;
		СтрокаОбъекта.Синоним	= ОбъектМетаданных.Синоним;
		СтрокаОбъекта.ПолноеИмя	= ОбъектМетаданных.ПолноеИмя();
		
	КонецЦикла;
	
	СтрокаКласса = ДеревоФормы.Строки.Добавить();
	СтрокаКласса.Имя = "Регистры накопления";
	СтрокаКласса.Картинка	= ЗаполнитьКартинкуВСтрокуДерева(СтрокаКласса.Имя);
	
	Для Каждого ОбъектМетаданных Из Метаданные.РегистрыНакопления Цикл
		
		СтрокаОбъекта = СтрокаКласса.Строки.Добавить();
		СтрокаОбъекта.Картинка	= ЗаполнитьКартинкуВСтрокуДерева(СтрокаКласса.Имя);
		СтрокаОбъекта.Имя		= ОбъектМетаданных.Имя;
		СтрокаОбъекта.Синоним	= ОбъектМетаданных.Синоним;
		СтрокаОбъекта.ПолноеИмя	= ОбъектМетаданных.ПолноеИмя();
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоФормы, "ДеревоМетаданных");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМетаданныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбраннаяСтрока = ДеревоМетаданных.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ОповеститьОВыборе(ВыбраннаяСтрока.ПолноеИмя);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьКартинкуВСтрокуДерева(УсловноеЗначение = Неопределено)
	
	СтроковоеЗначение = Строка(УсловноеЗначение);
	
	Если СтроковоеЗначение = "Планы обмена" Тогда
		Картинка = БиблиотекаКартинок.ПланОбмена;
	ИначеЕсли СтроковоеЗначение = "Справочники" Тогда
		Картинка = БиблиотекаКартинок.Справочник;
	ИначеЕсли СтроковоеЗначение = "Документы" Тогда
		Картинка = БиблиотекаКартинок.Документ;
	ИначеЕсли СтроковоеЗначение = "Журналы документов" Тогда
		Картинка = БиблиотекаКартинок.ЖурналДокументов;
	ИначеЕсли СтроковоеЗначение = "Отчеты" Тогда
		Картинка = БиблиотекаКартинок.Отчет;
	ИначеЕсли СтроковоеЗначение = "Обработки" Тогда
		Картинка = БиблиотекаКартинок.Обработка;
	ИначеЕсли СтроковоеЗначение = "Планы видов характеристик" Тогда
		Картинка = БиблиотекаКартинок.ПланВидовХарактеристик;
	ИначеЕсли СтроковоеЗначение = "Планы счетов" Тогда
		Картинка = БиблиотекаКартинок.ПланСчетов;
	ИначеЕсли СтроковоеЗначение = "Планы видов расчета" Тогда
		Картинка = БиблиотекаКартинок.ПланВидовРасчета;
	ИначеЕсли СтроковоеЗначение = "Регистры сведений" Тогда
		Картинка = БиблиотекаКартинок.РегистрСведений;
	ИначеЕсли СтроковоеЗначение = "Регистры накопления" Тогда
		Картинка = БиблиотекаКартинок.РегистрНакопления;
	ИначеЕсли СтроковоеЗначение = "Регистры бухгалтерии" Тогда
		Картинка = БиблиотекаКартинок.РегистрБухгалтерии;
	ИначеЕсли СтроковоеЗначение = "Регистры расчета" Тогда
		Картинка = БиблиотекаКартинок.РегистрРасчета;
	Иначе
		Картинка = "";
	КонецЕсли;
	
	Возврат Картинка;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции